In [39]:
import pandas as pd

In [40]:
df = pd.read_csv("./input/training_dataset.csv")

In [41]:
df.head()

,id,F1,F2,F3,F4,F5,F6,F7,F8,F9,F10,scribe
0,0,-0.091897,0.297600,0.079145,0.196496,0.261718,1.269960,0.446679,-0.751707,0.001721,0.998901,Philippus
1,1,-0.091897,0.226939,0.267634,0.024091,0.261718,-0.806282,0.597681,-0.601277,0.126447,-0.909619,Paithonius
2,2,0.167323,0.313302,0.168055,-0.383198,0.261718,0.190314,0.824183,0.558250,-0.247731,-0.148073,Marcus
3,3,-0.017834,-0.228430,0.370770,1.293671,0.172340,0.896237,0.182426,0.416867,1.373706,0.868284,Noaelius
4,4,0.043885,0.407516,-0.120014,0.281743,0.261718,-0.183409,0.106925,0.142896,0.531806,-0.101311,Marcus

In [42]:
df['scribe'].value_counts()

Marcus                5099
Philippus             2366
Franciscus            1325
Begonius              1019
Paithonius             632
Noaelius               602
Ubuntius               544
FerrumEffractarius     430
Name: scribe, dtype: int64

In [43]:
df.dtypes

id          int64
F1        float64
F2        float64
F3        float64
F4        float64
F5        float64
F6        float64
F7        float64
F8        float64
F9        float64
F10       float64
scribe     object
dtype: object

In [46]:
pd.get_dummies(df['scribe'])

,Begonius,FerrumEffractarius,Franciscus,Marcus,Noaelius,Paithonius,Philippus,Ubuntius
0,0,0,0,0,0,0,1,0
1,0,0,0,0,0,1,0,0
2,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,0
4,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...
12012,0,0,1,0,0,0,0,0
12013,0,0,0,1,0,0,0,0
12014,1,0,0,0,0,0,0,0
12015,0,0,0,1,0,0,0,0
12016,0,0,0,1,0,0,0,0

In [38]:
df['scribe'].value_counts()

0    10998
1     1019
Name: scribe, dtype: int64

In [33]:
X = df[['F1','F2','F3','F4','F5','F6','F7','F8','F9','F10']]
y = df[]

SyntaxError: invalid syntax (<ipython-input-33-38112987bce4>, line 2)